#+TITLE: Einführungsveranstaltung Informatik
#+LANGUAGE: de
#+SETUPFILE: setup/theme-readtheorg-local.setup
#+options: ^:nil


*** Variablen

 Variablen müssen in Python nicht deklariert werden:

 #+BEGIN_SRC python :results output :exports both
 x = 13
 print(x)
 x + 5 
 print(type(x))   # <type 'int'>
 x = "Hallo"
 print(x)
 print(type(x)) # <type 'str'>
 x = 12;
 print("x hat den Wert " + str(x))
 #+END_SRC

 #+RESULTS:
 : 13
 : <type 'int'>
 : Hallo
 : <type 'str'>
 : x hat den Wert 12

 In C/C#/Java etc. anders! 

*** Schleifen

Mit "range": 

#+BEGIN_SRC python :results output :exports both
for i in range(1,6): 
  print(str(i))
#+END_SRC

#+RESULTS:
: 1
: 2
: 3
: 4
: 5

Auf Einrückungen achten! 

*Beachte*: =range(...)= lässt den letzten Wert aus! 
- gewöhnungsbedürftig, ergibt aber Sinn im Umgang mit Arrays (sehen wir gleich)

Fakultät:

#+BEGIN_SRC python :results output :exports both
n = 10
ergebnis = 1
for i in range(1,n+1): 
  ergebnis = ergebnis * i

print(str(ergebnis))
#+END_SRC

#+RESULTS:
: 3628800

*** Funktionen

Schlüsselwort =def= leitet Funktion ein; Funktionen haben (i. d. R.) Parameter, die in runden Klammern angegeben werden: 

#+BEGIN_SRC python :results output :exports both
def say_hello(vorname, nachname):
  print("Hallo " + vorname + " " + nachname + "!")

say_hello("Richard","Stallman")
# Variante: "named parameter":
say_hello(nachname="Torvalds", vorname="Linus")
#+END_SRC

#+RESULTS:
: Hallo Richard Stallman!
: Hallo Linus Torvalds!

Auf Einrückungen achten!

"named parameter" gibt es so in C/C#/Java nicht! 

*Beachte*: 
- Funktions-*Deklaration* mit =def=: =def say_hello(...)= 
- Funktions-*Aufruf* ohne =def=: =say_hello("Richard", "Stallman")=
  - Funktionsaufrufe müssen Parameter "bedienen" 

Eine Funktion wird nur *einmal* deklariert, kann aber *beliebig oft* aufgerufen werden! 

Konvention zur Namensgebung von Funktionen in Python: Wort-Bestandteile werden durch Unterstriche getrennt: =say_hello=; in C# ist dagegen "CamelCase" die Konvention: =SayHello= 

Funktion mit Rückgabe (Schlüsselwort =return=):

#+BEGIN_SRC python :results output :exports both
def square(x):
  return x*x

print(square(3))
print(square(1001))
#+END_SRC

#+RESULTS:
: 9
: 1002001


Fakultät:

#+BEGIN_SRC python :results output :exports both
def fakultaet(n):
  ergebnis = 1
  for i in range(1,n+1):
    ergebnis = ergebnis * i
  return ergebnis

print(fakultaet(10))
print(fakultaet(99))
#+END_SRC

#+RESULTS:
: 362880
: 9426890448883247745626185743057242473809693764078951663494238777294707070023223798882976159207729119823605850588608460429412647567360000000000000000000000

*Unterschied zu C/C#/Java*: Python geht "automatisch" mit großen Zahlen korrekt um! 

Kompromiss bei C-artigen Sprachen, die meist nach dem Prinzip "make the common case fast" agieren:
- z. B. =int=-Datentyp (üblicherw. 32 Bit) in C/C#/Java für "schnelle" und "hardwarenahe" Berechnungen, aber mit Einschränkungen in Bezug auf Größe! 

Fakultät rekursiv:

#+BEGIN_SRC python :results output :exports both
def fakultaet(n):
  if n == 0: return 1
  else: return n * fakultaet(n-1)

print(fakultaet(10))
print(fakultaet(99))
#+END_SRC

#+RESULTS:
: 3628800
: 933262154439441526816992388562667004907159682643816214685929638952175999932299156089414639761565182862536979208272237582511852109168640000000000000000000000

*Beachte*: in Python scheint es doch ein recht niedriges Rekursionslimit (ca. 100 Rekursionen) zu geben. Andere Sprachen wie /Erlang/ oder /Haskell/ können das besser! 

*** Listen 

"Ähnlich" wie Arrays in Java, C#, C etc., aber 
- dynamisch
- können Werte unterschiedlichen Typs aufnehmen 

Python kennt auch Arrays, siehe bspw.  https://www.programiz.com/python-programming/array

#+BEGIN_SRC python :exports both :results output
names = ["Joseph Weizenbaum", "Marvin Minsky", "Steve Russel", "Richard Stallman", "Linus Torvalds"]

print(len(names))
print(names)
print("erstes Element: " + names[0])

for name in names: 
  print name 

names.append("Claude Shannon")
print(len(names))
print(names)

numbers = [1,2,3,4,5]

print(len(numbers))
print(numbers)
for num in numbers:
  print(num)

#+END_SRC

#+RESULTS:
#+begin_example
5
['Joseph Weizenbaum', 'Marvin Minsky', 'Steve Russel', 'Richard Stallman', 'Linus Torvalds']
erstes Element: Joseph Weizenbaum
Joseph Weizenbaum
Marvin Minsky
Steve Russel
Richard Stallman
Linus Torvalds
6
['Joseph Weizenbaum', 'Marvin Minsky', 'Steve Russel', 'Richard Stallman', 'Linus Torvalds', 'Claude Shannon']
5
[1, 2, 3, 4, 5]
1
2
3
4
5
#+end_example




#+BEGIN_SRC python :results output :exports both 
def square(x): 
  return x*x

numbers = range(1,6)
print(numbers)
# quadriere alle Zahlen in numbers: 
squared =  [square(num) for num in numbers]
print(squared)
#+END_SRC

#+RESULTS:
: [1, 2, 3, 4, 5]
: [1, 4, 9, 16, 25]

Braucht man die Indizes, kann =enumerate= oder =range= verwendet werden:

#+BEGIN_SRC python :results output :exports both 
numbers = range(10,1,-1) 
print(numbers)

for i, num in enumerate(numbers):
  print(str(i) + ": " + str(num))

print("")
# alternativ: 
for i in range(0, len(numbers)): 
  print(str(i) + ": " + str(numbers[i]))
#+END_SRC

#+RESULTS:
#+begin_example
[10, 9, 8, 7, 6, 5, 4, 3, 2]
0: 10
1: 9
2: 8
3: 7
4: 6
5: 5
6: 4
7: 3
8: 2

0: 10
1: 9
2: 8
3: 7
4: 6
5: 5
6: 4
7: 3
8: 2
#+end_example

*Strings sind Listen* 

#+begin_src python
s = "Justin Bieber"
s[0] # 'J'
s[-1] # 'r' 
#+end_src


*Generatoren*


#+BEGIN_SRC python :results output :exports both 
def square(x): 
  return x*x

def even(x):
  if x % 2 == 0: return True
  else: return False

squares = [square(x) for x in range(1,10)]
evensquares = [square(x) for x in range(1,10) if even(x)]

print(squares)
print(evensquares)

#+END_SRC

#+RESULTS:
: [1, 4, 9, 16, 25, 36, 49, 64, 81]
: [4, 16, 36, 64]




*** COMMENT Lösungen

a) 

#+begin_src python 
[x*x*x for x in range(1000,0,-1) if x*x*x % 5 == 0]
#+end_src

#+RESULTS:
None

b)

#+begin_src python
import random
randInts = [random.randint(100) for x in range(100)]
max(randInts)
#+end_src

c) wie b), dann:

#+begin_src python
summe = 0
for x in randInts:
  summe += x
summe/len(randInts) 
#+end_src

d) Einfach mit Funktion "random.choices":

#+begin_src python
import random 

def sechs_aus_neunundvierzig():
  return random.choices(range(1,50), k=6)

sechs_aus_neunundvierzig()
#+end_src


Komplizierter "zu Fuß": 

#+begin_src python
import random 

def sechs_aus_neunundvierzig():
  values = [x for x in range(1,50)]
  result = [] 
  for value in values:
    result.append(value)
    values.remove(value)
  return result

sechs_aus_neunundvierzig()

#+end_src

#+RESULTS:
: None

e) 

Schönste Lösung: 

#+begin_src python
def reverse_string(s):
  return s[::-1]
#+end_src

"zu Fuß": 

#+begin_src python
def reverse(s):
  result = ""
  for c in s:
    result = c + result
  return result
#+end_src

f) 

#+begin_src python
def ist_palindrom(s): 
  for c in range(int(len(s)/2)):
    if s[c] != s[-(c+1)]:
      return False
  return True

ist_palindrom("regallager") # True
ist_palindrom("regaxlager") # False 
#+end_src


g)

#+begin_src python
def next_fib(a,b): 
  return a+b

def fibs(n): 
  if (n == 1): return [1]
  if (n == 2): return [1,1]
  result = [1,1]
  for i in range(n-2):
    result.append(next_fib(result[-2], result[-1]))
  return result
#+end_src


Ein paar der Aufgaben in C# gelöst: 
#+begin_src csharp
using System; 

class Test {
  static int square(int x) {
    return x*x;
  }

  static int[] RandomNumbers(int howmany) {
    Random random = new Random(); 
    int[] result = new int[howmany];
    for (int i = 0; i < howmany; i++)
      result[i] = random.Next(); 
    return result;
  }

  static int Maximum(int[] values) {
    int max = Int32.MaxValue;
    foreach (int value in values) {
      if (value > max) max = value;
    }
    return max; 
  }

  static double Mittelwert(int[] values) {
    int sum = 0;
    foreach(var value in values) sum += value;
    return sum/values.Length; 
  }

  public static void Main() {
    System.Console.WriteLine(square(13));
    Console.WriteLine(Maximum(RandomNumbers(100)));
  }
}
#+end_src

#+RESULTS:
|        169 |
| 2147483647 |



